Repository: Amir-Hzz79/planza
Catalog: lib/core/locale/app_*.arb
Languages: fa

# appName
source: Planza
fa: پلانزا

# general_add
source: Add
fa: افزودن

# general_save
source: Save Changes
fa: ذخیره تغییرات

# general_create
source: Create
fa: ساختن

# general_delete
source: Delete
fa: حذف

# general_deleteConfirm
source: Confirm Delete
fa: تایید حذف

# general_edit
source: Edit
fa: ویرایش

# general_cancel
source: Cancel
fa: لغو

# general_done
source: Done
fa: انجام شد

# general_tasks
source: Tasks
fa: کارها

# general_goals
source: Goals
fa: اهداف

# general_description
source: Description
fa: توضیحات

# general_title
source: Title
fa: عنوان

# general_status
source: Status
fa: وضعیت

# general_priority
source: Priority
fa: اولویت

# general_tags
source: Tags
fa: برچسب‌ها

# general_deadline
source: Deadline
fa: موعد مقرر

# general_color
source: Color
fa: رنگ

# general_icon
source: Icon
fa: آیکون

# general_optional
source: Optional
fa: (اختیاری)

# general_today
source: Today
fa: امروز

# general_tomarrow
source: Tomorrow
fa: فردا

# general_overdue
source: Overdue
fa: موعد گذشته

# general_dueToday
source: Due Today
fa: موعد امروز

# general_noDate
source: No Date
fa: بدون تاریخ

# general_completed
source: Completed
fa: تکمیل شده

# general_profile
source: Profile
fa: پروفایل

# general_language
source: Language
fa: زبان

# general_settings
source: Settings
fa: تنظیمات

# general_support
source: Support
fa: پشتیبانی

# general_about
source: About
fa: درباره ما

# general_exitConfirm
source: Press back again to exit
fa: برای خروج دوباره بازگشت را بزنید

# general_share
source: Share
fa: اشتراک‌گذاری

# general_achievement
source: ACHIEVEMENT
fa: دستاورد

# general_duration
source: Duration
fa: مدت زمان

# general_tasksCount
source: Tasks ({tasksCount})
fa: ({tasksCount}) کار

# general_duration_day
source: {dayCount} Days
fa: {dayCount} روز

# homePage_title
source: Your Dashboard
fa: داشبورد شما

# homePage_greeting_morning
source: Good Morning!
fa: صبح بخیر!

# homePage_greeting_afternoon
source: Good Afternoon!
fa: عصر بخیر!

# homePage_greeting_evening
source: Good Evening!
fa: شب بخیر!

# homePage_todaysFocus_title
source: Today's Focus üî•
fa: تمرکز امروز 🔥

# homePage_todaysFocus_empty
source: You're all clear for today! Ready to plan your next move?
fa: برای امروز همه چیز تمیزه! آماده‌ای برای حرکت بعدی؟

# homePage_activeGoals_title
source: Driving These Goals
fa: در مسیر این اهداف

# homePage_momentum_title
source: Your Weekly Momentum
fa: مومنتوم هفتگی شما

# homePage_statsBar_title
source: Your Vital Signs
fa: علائم حیاتی شما

# homePage_activeGoalCarousel_title
source: Driving These Goals
fa: در مسیر این اهداف

# homePage_weeklyChart_title
source: Your Consistency
fa: پایداری

# homePage_tagAnalysisChart_title
source: Where Your Energy Goes
fa: انرژی شما کجا صرف می‌شود

# homePage_statsBar_streak_title
source: Day Streak
fa: روز متوالی

# homePage_statsBar_activeGoals_title
source: Active Goals
fa: اهداف فعال

# homePage_statsBar_weekTasks_title
source: Tasks this Week
fa: کارهای این هفته

# homePage_energy_title
source: Where Your Energy Goes
fa: انرژی شما کجا صرف می‌شود

# homePage_fab_addTask
source: New Task
fa: کار جدید

# homePage_fab_addGoal
source: New Goal
fa: هدف جدید

# homePage_dashboardOverview_progress
source: Progress
fa: پیشرفت

# homePage_dashboardOverview_tasksLeft
source: Tasks Left
fa: کارهای مانده

# homePage_dashboardOverview_deadline_noDeadLine
source: No Deadline
fa: بدون موعد

# homePage_dashboardOverview_deadline_overDue
source: Days Overdue
fa: روز گذشته

# homePage_dashboardOverview_deadline_daysLeft
source: Days Left
fa: روز مانده

# goalsPage_title
source: My Ambitions
fa: جاه‌طلبی‌های من

# goalsPage_active_tab
source: Active
fa: فعال

# goalsPage_completed_tab
source: Completed
fa: تکمیل شده

# goalsPage_active_empty
source: Every great journey starts with a single goal. Add your first one!
fa: هر سفر بزرگی با یک قدم کوچک شروع می‌شه. اولین هدفت رو بساز!

# goalsPage_completed_empty
source: You haven't completed any goals yet. Keep going!
fa: هنوز هیچ هدفی رو کامل نکردی. ادامه بده!

# goalsPage_goals_empty
source: Your ambitions will appear here. Let's create your first goal!
fa: جاه‌طلبی‌های تو اینجا نمایش داده می‌شن. بیا اولین هدفت رو بسازیم!

# goalsPage_addGoal_button
source: Create a Goal
fa: ساختن یک هدف

# goalsPage_featuredGoals_title
source: Up Next...
fa: قدم بعدی...

# goalsPage_activeGoals_title
source: Keep Going!
fa: ادامه بده!

# goalsPage_completedGoals_title
source: Hall of Fame üèÜ
fa: تالار افتخارات 🏆

# goalDetailsPage_notExist
source: This goal no longer exists.
fa: این هدف دیگر وجود ندارد.

# goalDetailsPage_editGoal
source: Edit Goal
fa: ویرایش هدف

# goalDetailsPage_deleteGoal
source: Delete Goal
fa: حذف هدف

# goalCard_taskCount
source: {taskCount} Tasks
fa: {taskCount} کار

# tasksPage_title
source: My Tasks
fa: کارهای من

# tasksPage_search_hint
source: Search tasks, goals, tags...
fa: جستجوی کار، هدف، برچسب...

# tasksPage_filter_title
source: Sort & Filter
fa: مرتب‌سازی و فیلتر

# tasksPage_filter_reset
source: Reset
fa: بازنشانی

# tasksPage_filter_apply
source: Apply Filters
fa: اعمال فیلترها

# tasksPage_filter_showCompleted
source: Show Completed Tasks
fa: نمایش کارهای تکمیل شده

# tasksPage_filter_goal_title
source: Filter by Goal
fa: فیلتر بر اساس هدف

# tasksPage_filter_goal_selected
source: {goalCount} selected
fa: {goalCount} انتخاب شده

# tasksPage_filter_goalSelection_title
source: Select Goals
fa: انتخاب اهداف

# tasksPage_filter_tag_title
source: Filter by Tags
fa: فیلتر بر اساس برچسب

# tasksPage_filter_tag_selected
source: {tagCount} selected
fa: {tagCount} انتخاب شده

# tasksPage_filter_tagSelection_title
source: Select Tags
fa: انتخاب برچسب‌ها

# tasksPage_calendar_noTasks
source: No tasks scheduled.
fa: کاری برای این روز نیست.

# tasksPage_calendar_addTask_toolTip
source: Add Task for this day
fa: افزودن کار برای این روز

# tasksPage_calendar_sheet_title
source: Tasks for {date}
fa: کارهای تاریخ {date}

# tasksPage_grouped_overdue
source: Overdue
fa: موعد گذشته

# tasksPage_grouped_today
source: Today
fa: امروز

# tasksPage_grouped_tomorrow
source: Tomorrow
fa: فردا

# tasksPage_grouped_empty
source: No tasks found.
fa: کاری یافت نشد.

# tasksPage_pills_completed
source: Showing Completed
fa: نمایش تکمیل‌شده‌ها

# taskDetailsPage_goal_label
source: Goal
fa: هدف

# taskDetailsPage_date_label
source: Due Date
fa: تاریخ موعد

# taskDetailsPage_priority_label
source: Priority
fa: اولویت

# taskDetailsPage_checklist_title
source: Checklist ({subtaskCount})
fa: چک‌لیست ({subtaskCount})

# taskDetailsPage_button_unCompleted
source: Mark as Complete
fa: علامت‌گذاری به عنوان انجام‌شده

# taskDetailsPage_button_completed
source: Completed on {doneDate}
fa: تکمیل در {doneDate}

# taskDetailsPage_priorityLevel
source: Level {level}
fa: سطح {level}

# addGoalPage_title_add
source: Create a Goal
fa: ساختن هدف

# addGoalPage_title_edit
source: Edit Goal
fa: ویرایش هدف

# addGoalPage_name_label
source: Goal Name
fa: نام هدف

# addGoalPage_name_validator
source: Please enter a name
fa: لطفا یک نام وارد کنید

# addGoalPage_name_required
source: Every goal needs a name!
fa: هر هدفی به یک نام نیاز داره!

# addGoalPage_description_label
source: Description (Optional)
fa: توضیحات (اختیاری)

# addGoalPage_description_hint
source: Add more details about your goal...
fa: جزئیات بیشتری درباره هدفت بنویس...

# addGoalPage_color_label
source: Choose a Color
fa: یک رنگ انتخاب کن

# addGoalPage_icon_label
source: Choose an Icon
fa: یک آیکون انتخاب کن

# addGoalPage_deadline_label
source: Deadline (Optional)
fa: موعد مقرر (اختیاری)

# addGoalPage_deadline_notSet
source: Not set
fa: تعیین نشده

# addGoalPage_tasks_label
source: Add first steps (Optional)
fa: اولین قدم‌ها رو اضافه کن (اختیاری)

# addGoalPage_tasks_hint
source: Add a new step...
fa: اضافه کردن یک قدم جدید...

# addGoalPage_button_add
source: Create Goal
fa: بسازش!

# addGoalPage_button_edit
source: Save Changes
fa: ذخیره تغییرات

# addGoalPage_noDate
source: Not set
fa: تعیین نشده

# addGoalPage_tasks_index
source: Task #{index}
fa: کار #{index}

# addTaskSheet_title_add
source: New Task
fa: کار جدید

# addTaskSheet_title_edit
source: Edit Task
fa: ویرایش کار

# addTaskSheet_hint
source: e.g., Finish presentation by 5 PM
fa: مثلا: تمام کردن گزارش تا ساعت ۵ عصر

# addTaskSheet_button_add
source: Add Task
fa: افزودن کار

# addTaskSheet_button_edit
source: Save Changes
fa: ذخیره تغییرات

# addTaskSheet_description_hint
source: Add more details...
fa: جزئیات بیشتر...

# addTaskSheet_chip_noGoal
source: No Goal
fa: بدون هدف

# addTaskSheet_chip_dueDate
source: Due Date
fa: تاریخ موعد

# addTaskSheet_chip_tagCount
source: {tagCount} Tags
fa: {tagCount} برچسب

# addTaskSheet_edit_successMessage
source: Task Updated!
fa: کار ویرایش شد!

# addTaskSheet_add_successMessage
source: Task Added!
fa: کار اضافه شد!

# deleteDialog_goal_title
source: Delete '{goalName}'?
fa: حذف هدف '{goalName}'؟

# deleteDialog_goal_content
source: This goal contains {taskCount} tasks. This action cannot be undone.
fa: این هدف شامل {taskCount} کار است. این عمل قابل بازگشت نیست.

# deleteDialog_goal_options_title
source: Please choose how to handle these tasks:
fa: لطفا مشخص کنید با این کارها چه شود:

# deleteDialog_goal_option_unassign_title
source: Unassign tasks & delete goal
fa: حذف هدف و بی‌هدف کردن کارها

# deleteDialog_goal_option_unassign_subtitle
source: The tasks will be kept without a goal.
fa: کارها باقی می‌مانند اما دیگر هدفی ندارند.

# deleteDialog_goal_option_deleteAll_title
source: Delete goal AND all tasks
fa: حذف هدف و تمام کارهای آن

# deleteDialog_goal_option_deleteAll_subtitle
source: All ${taskCount} tasks will be permanently deleted.
fa: تمام {taskCount} کار برای همیشه حذف خواهند شد.

# deleteDialog_task_title
source: Delete Task?
fa: حذف کار؟

# deleteDialog_task_content
source: Are you sure you want to permanently delete this task? This action cannot be undone.
fa: آیا از حذف دائمی این کار مطمئن هستید؟ این عمل قابل بازگشت نیست.

# daysLeft
source: {count, plural, =0{Due today} =1{1 day left} other{{count} days left}}
fa: {count, plural, zero{موعد امروز است} one{۱ روز مانده} other{{count} روز مانده}}

# goalSelection_noGoal
source: No Goal
fa: بدون هدف

# goalAchievement_title
source: GOAL ACHIEVED!
fa: هدف محقق شد!

# goalAchievement_tasksCompleted_title
source: Tasks Completed
fa: کارهای تکمیل شده

# goalAchievement_completed_title
source: Completed On
fa: تاریخ تکمیل

# goalCard_completed_title
source: GOAL ACHIEVED!
fa: هدف محقق شد!

# goalCard_noTasks
source: Let's get started!
fa: بیا شروع کنیم!

# goalCard_tasksProgress
source: {completedCount} of {totalCount} tasks complete
fa: {completedCount} از {totalCount} کار تکمیل شده
